/*****************************************************************************
 * 设备相关参数
 * Author: Dong Xiaoguang
 * Created on 2015/12/14
 *****************************************************************************/
#ifndef MEMSIC_CUSTOM_SPEC_H_INCLUDED
#define MEMSIC_CUSTOM_SPEC_H_INCLUDED

//-----------------------------------------------------------------------------
float ts0 = 0.02;//采样周期

//-----------------------------------------------------------------------------
// 磁参数
float si[3][3] = {{1,0,0},// first R9 sent to me
            {0,1,0},
            {0,0,1}};
            //{  {1.0022,0.11104,-0.044565},// second R9 sent to me
            //        {0.054862,0.95688,0.0083588},
            //        {-0.015626,0.013709,1.108} };
float magVar[3] = {0.1,0.1,0.1};// 磁噪声, uT^2
//-----------------------------------------------------------------------------
// 陀螺参数
int enableGyroCal = 1 ;             //陀螺是否需要校准常偏
int outlierGyroRestart = 3;         //算法重启后，陀螺的野值数量，需要丢掉
float iniGyroBias[3] = {1e-5,1e-5,1e-5};//初始陀螺常偏，rad/s
int gyroGrade = 2000;               //陀螺指标，0表示精度差，数值越大，代表陀螺性能越好，最大不超过5000

//-----------------------------------------------------------------------------
// 校准参数
int extraSampleCount[3] = {0,0,0};  //手动调整校准精度分别到1、2和3所需的点数，调整量不超过5个点

#endif // MEMSIC_CUSTOM_SPEC_H_INCLUDED
